app/controllers/api/abouts_controller.rb

SELECT "abouts".* FROM "abouts"
---
    def index
        @about = About.all