app/controllers/api/categories_controller.rb

    def show
        category = Category.find_by(id: params[:id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]