app/controllers/api/communities_controller.rb

SELECT "communities".* FROM "communities"
---
    def index
        @communities = Community.all