app/controllers/api/events_controller.rb

    def index
        render json: Event.all,status: :ok
---
SELECT "events".* FROM "events"