app/controllers/api/login_slides_controller.rb

SELECT "login_slides".* FROM "login_slides"
---
    def index
        slides = LoginSlide.all