app/controllers/api/payments_controller.rb

INSERT INTO "payments" ("amount", "phone_number", "response", "vip_tickets", "regular_tickets", "event_id", "ticket_format", "CheckoutRequestID", "MerchantRequestID", "state", "code", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
---
    def payment
        phone = PhonyRails.normalize_number(params[:phone_number], country_code: 'KE').gsub(/\W/, '')
        payZ = current_user.payments.create!(amount: params[:amount], phone_number: phone, ticket_format: params[:ticket_format], event_id: params[:event_id], user_id: params[:user_id], vip_tickets: params[:vip_tickets], regular_tickets: params[:regular_tickets])

SELECT "transactions".* FROM "transactions" WHERE "transactions"."CheckoutRequestID" = $1 AND "transactions"."MerchantRequestID" = $2 LIMIT $3  [["CheckoutRequestID", "null"], ["MerchantRequestID", "null"], ["LIMIT", 1]]
---
    def transaction_details
        transaction = Transaction.find_by(CheckoutRequestID: params[:CheckoutRequestID], MerchantRequestID: params[:MerchantRequestID])

SELECT "payments".* FROM "payments" WHERE "payments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def find_payment
        Payment.find_by(id: params[:id])