app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "role", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["email", "kihahumutagah@gmail.com"], ["password_digest", "[FILTERED]"], ["role", "user"], ["created_at", "2022-11-10 07:25:26.998684"], ["updated_at", "2022-11-10 07:25:26.998684"]]
---
    def create
        @user = User.create!(user_params)