app/controllers/application_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def current_user
      if decoded_token
        # Using the decoded token, grab the user_id stored within it and find a user
        user_id = decoded_token[0]['user_id']
        @user = User.find(user_id)