app/controllers/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "kihahumutagah@gmail.com"], ["LIMIT", 1]]
---
    def create
      @user = User.find_by(email: user_login_params[:email])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def auto_login
      @token = params[:token]
      user = User.find(JWT.decode(@token, "194715b3254c06ed3776a68387af819b76", true, algorithm: 'HS256')[0]["user_id"])