app/models/payment.rb

UPDATE "payments" SET "response" = $1, "updated_at" = $2 WHERE "payments"."id" = $3  [["response", "Error connecting to Redis on 127.0.0.1:6379 (Errno::ECONNREFUSED)"], ["updated_at", "2022-11-17 04:37:58.040278"], ["id", 1]]
---
    def push_stk
        begin
        response = MpesaStk::PushPayment.call(amount, phone_number)
        p response

        self.MerchantRequestID = response['MerchantRequestID']
        self.CheckoutRequestID = response['CheckoutRequestID']
        self.response = response
        self.save
        rescue => ex
        p ex.message

        self.response = ex.message
        self.save